
DROP DATABASE IF EXISTS lab_1;

CREATE DATABASE IF NOT EXISTS lab_1;

CREATE TABLE IF NOT EXISTS lab_1.library (
  id INT UNSIGNED AUTO_INCREMENT PRIMARY KEY,
  Numer INT NOT NULL,
  Code INT NOT NULL UNIQUE,
  New boolean NOT NULL,
  Name varchar(255) NOT NULL,
  Price decimal(5, 2) DEFAULT('default value') NULL,
  Producer VARCHAR(128) NOT NULL,
  Pages INT NOT NULL,
  Form VARCHAR(255)  DEFAULT NULL,
  Date DATE DEFAULT NULL,
  Circulation INT NOT NULL,
  Topic VARCHAR(100) NOT NULL,
  Category VARCHAR(100) NOT NULL
);

CREATE INDEX CategoryIndex ON lab_1.library(Numer);

INSERT INTO lab_1.library (`Numer`, `Code`, `New`, `Name`, `Price`, `Producer`, `Pages`, `Form`, `Date`, `Circulation`, `Topic`, `Category`) VALUES
(2, 5110, 0, 'Апаратні засоби мультимедіа.Відеосистема PC', 15.51, 'Видавнича група BHV', 400, '70х100/16', '2000-07-24', 5000, 'Використання ПК в цілому', 'Підручники'),
(8, 4985, 0, 'Засвой самостійно модернізацію та ремонт ПК за 24 години, 2-ге вид', 18.9, 'Вiльямс', 288, '70х100/16', '2000-07-07', 5000, 'Використання ПК в цілому', 'Підручники'),
(9, 5141, 0, 'Структури даних та алгоритми', 37.8, 'Вільямс', 384, '70х100/16', '2000-09-29', 5000, 'Використання ПК в цілому', 'Підручники'),
(20, 5127, 0, 'Автоматизація інженерно-графічних робіт', 11.58, 'Видавнича група nBHV ', 256, '70х100/16', '2000-06-15', 5000, 'Використання ПК в цілому', 'Підручники'),
(31, 5113, 0, 'Апаратні засоби мультимедіа. Відеосистема РС', 15.51, 'Видавнича група nBHV', 400, '70х100/16', '2000-07-24', 5000, 'Використання ПК в цілому', 'Апаратні засоби ПК'),
(46, 5199, 0, 'Залізо IBM 2001', 30.07, 'МикроАрт', 368, '70х100/16', '2000-02-12', 5000, 'Використання ПК в цілому', 'Апаратні засоби ПК'),
(50, 3851, 0, 'Захист інформації та безпека компютерних nсистем', 26, 'DiaSoft', 480, '84х108/16', '1900-01-01', 5000, 'Використання ПК в цілому', 'Захист і безпека ПК'),
(58, 3932, 0, 'Як перетворити персональний компютер nна вимірювальний комплексс', 7.65, 'ДМК', 144, '60х88/16', '2000-06-09', 5000, 'Використання ПК в цілому', 'Інші книги'),
(59, 4713, 0, 'Plug-ins. Додаткові програми для музичних nпрограм', 11.41, 'ДМК', 144, '70х100/16', '2000-02-22', 5000, 'Використання ПК в цілому', 'Інші книги'),
(175, 5217, 0, 'Windows МЕ. Найновіші версії програм', 16.57, 'Триумф', 320, '70х100/16', '2000-08-25', 5000, 'Операційні системи', 'Windows 2000'),
(176, 4829, 0, 'Windows 2000 Professional крок за кроком з CD', 27.25, 'Эком', 320, '70х100/16', '2000-04-28', 5000, 'Операційні системи', 'Windows 2000'),
(188, 5170, 0, 'Linux версії', 24.43, 'ДМК', 346, '70х100/16', '2000-09-29', 5000, 'Операційні системи', 'Linux'),
(191, 860, 0, 'Операційна система UNIX', 3.5, 'Видавнича група BHV', 395, '84х10016', '1997-05-05', 5000, 'Операційні системи', 'Unix'),
(203, 44, 0, 'Відповіді на актуальні запитання щодо OS/2 nWarp', 5, 'DiaSoft', 352, '60х84/16', '1996-03-20', 5000, 'Операційні системи', 'Інші операційні системи'),
(206, 5176, 0, 'Windows Ме. Супутник користувача', 12.79, 'Видавнича група nBHV', 306, '', '2000-10-10', 5000, 'Операційні системи', 'Інші операційні системи'),
(209, 5462, 0, 'Мова програмування С++. Лекції та вправи ', 29, 'DiaSoft', 656, '84х108/16', '2000-12-12', 5000, 'Програмування', 'C&C++'),
(210, 4982, 0, 'Мова програмування С. Лекції та вправи', 29, 'DiaSoft', 432, '84х108/16', '2000-12-07', 5000, 'Програмування', 'C&C++'),
(220, 4687, 0, 'Ефективне використання C++ .50 nрекомендацій щодо покращення ваших nпрограм та проектів ', 17.6, 'ДМК', 240, '70х100/16', '2000-03-02', 5000, 'Програмування', 'C&C++'),
(222, 235, 0, 'Інформаційні системи і структури даних', null, 'Києво-Могилянська nакадемія', 288, '60х90/16', null, 400, 'Використання ПК в nцілому', 'Інші книги'),
(225, 8746, 1, 'Бази даних в інформаційних системах', null, 'Університет "Україна"', 418, '60х84/16', '2018-07-25', 100, 'Програмування', 'SQL'),
(226, 2154, 1, 'Сервер на основі операційної системи nFreeBSD 6.1', 0, 'Університет "Україна"', 216, '60х84/16', '2015-11-03', 500, 'Програмування ', 'Інші операційні системи'),
(245, 2662, 0, 'Організація баз даних та знань', 0, 'Вінниця: ВДТУ', 208, '60х90/16', '2001-10-10', 1000, 'Програмування', ' SQL'),
(247, 5641, 1, 'Організація баз даних та знань', 0, 'Видавнича група BHV', 384, '70х100/16', '2021-12-15', 5000, 'Програмування ', 'SQL');

ALTER TABLE lab_1.library ADD Author varchar(25);

ALTER TABLE lab_1.library MODIFY COLUMN Author varchar(25);

ALTER TABLE lab_1.library DROP COLUMN Author;

CREATE UNIQUE INDEX lab_index ON lab_1.library (Numer);

SELECT * FROM lab_1.library ORDER BY Numer DESC;
DROP INDEX lab_index ON lab_1.library;


